#include "iostream"
/*int main() {
	int month = 06, day = 07;
	std::cout << month << day;
}
*/
/*
2.1.3
练习2.5
a；’a‘是字符字面值。L'a’是宽字符字面值。”a“是字符串字面值。L”a“是宽字符串字面值。
b；10是整型字面值。10u是无符号整型字面值。10L是类型为long的整型字面值。
10ul类型为unsigned long，无符号整型字面值。012是八进制12的整型字面值常量。
0xC是十六进制的C的整型字面值常量
c：3.14浮点字面值常量。3.14f浮点字面值常量类型为float。3.14L为long浮点型字面值常量，类型为long float
d：10为整型字面值常量。10u为无符号整型字面值常量。
10.为missing integer or fraction。10e-2为10的负二次方，浮点型字面值。

练习2.6
有
第一组是整型字面值
第二组0开头，后面9和7为八进制

练习2.7
a;字符串字面值，里面有\145代表转义序列，\012代表转义序列
b;3.14eLL
c;1024f为1024浮点字面值
d:3.14L为扩展浮点字面值，类型为long
*/

int main() {
	std::cout << "2M" << '\n' << "2" << '\t' << "M" << '\n';
}